<a href="https://colab.research.google.com/github/MaxTechniche/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/Jacob_Maxfield_LS_DS20_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-09-03 00:16:03--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.10.37
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.10.37|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.4’

instacart_online_gr 100%[===================>] 196.03M  15.8MB/s    in 14s

2020-09-03 00:16:17 (14.1 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.4’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [5]:
##### YOUR CODE HERE #####
"""
I need:
product_name
product_id
"""

# checking which datasets have what i need
# !head aisles.csv -                                              Nope
# !head departments.csv -                                         Nope
# !head order_products__prior.csv - Has product_id.               Yes
# !head order_products__train.csv - Same as other order products. Yes
# !head orders.csv -                                              Nope
# !head products.csv - Has product_name and product_id.           Yes

'\nI need:\nproduct_name\nproduct_id\n'

In [6]:
# Import needed modules
import pandas as pd

# Concatting order_product DataFrames
order_products = pd.concat([pd.read_csv('order_products__prior.csv'),
                           pd.read_csv('order_products__train.csv')])
# Make sure everything looks good
order_products.shape

(33819106, 4)

In [7]:
# Quick look at head and tail
order_products

         order_id  product_id  add_to_cart_order  reordered
0               2       33120                  1          1
1               2       28985                  2          1
2               2        9327                  3          0
3               2       45918                  4          1
4               2       30035                  5          0
...           ...         ...                ...        ...
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

[33819106 rows x 4 columns]

In [8]:
# verifying tail of order_products__train
!tail order_products__train.csv

3421058,30316,6,1
3421058,35578,7,0
3421058,32650,8,1
3421063,49235,1,1
3421063,13565,2,1
3421063,14233,3,1
3421063,35548,4,1
3421070,35951,1,1
3421070,16953,2,1
3421070,4724,3,1

Looks good!

In [9]:
# Now for the products table
# loading in products.csv
products = pd.read_csv('products.csv')

# Quick look
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [10]:
# Removing columns I don't need from the products dataframe
products = products.drop(columns=['aisle_id', 'department_id'])
print(products.shape)
products.head()

(49688, 2)

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [11]:
# Also remove columns in order_products dataframe
product_order_ids = order_products.drop(columns=['add_to_cart_order', 'reordered', 'order_id'])
product_order_ids.head()

   product_id
0       33120
1       28985
2        9327
3       45918
4       30035

In [12]:
# Merging the product_names with the product_ids
product_order_counts = pd.merge(products, product_order_ids, how='outer')
product_order_counts.head()

   product_id                product_name
0           1  Chocolate Sandwich Cookies
1           1  Chocolate Sandwich Cookies
2           1  Chocolate Sandwich Cookies
3           1  Chocolate Sandwich Cookies
4           1  Chocolate Sandwich Cookies

In [13]:
# I can display the top 10 values by doing this
top10 = product_order_counts['product_name'].value_counts().head(10)
top10

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [14]:
# BUT I want to add it to what's already there
# So I create a DataFrame from the value_counts of the product_name column
product_counts = product_order_counts['product_name'].value_counts().rename_axis('product_name').reset_index(name='counts')
product_counts.head()

             product_name  counts
0                  Banana  491291
1  Bag of Organic Bananas  394930
2    Organic Strawberries  275577
3    Organic Baby Spinach  251705
4    Organic Hass Avocado  220877

In [15]:
# Because I now know how many orders of each product there are
# I can drop each duplicate from the other dataframe
product_order_counts = product_order_counts.drop_duplicates()
product_order_counts.head()

      product_id                                       product_name
0              1                         Chocolate Sandwich Cookies
1928           2                                   All-Seasons Salt
2022           3               Robust Golden Unsweetened Oolong Tea
2305           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
2656           5                          Green Chile Anytime Sauce

In [16]:
# Then I merge the two dataframes to create one that has
# the product_id, the product_name, AND the count
product_order_counts = pd.merge(product_order_counts, product_counts, how='inner')
# Printing out the first 10 after sorting
product_order_counts.sort_values(by='counts', ascending=False).head(10)

       product_id            product_name  counts
24851       24852                  Banana  491291
13175       13176  Bag of Organic Bananas  394930
21136       21137    Organic Strawberries  275577
21902       21903    Organic Baby Spinach  251705
47208       47209    Organic Hass Avocado  220877
47765       47766         Organic Avocado  184224
47625       47626             Large Lemon  160792
16796       16797            Strawberries  149445
26208       26209                   Limes  146660
27844       27845      Organic Whole Milk  142813

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2

In [17]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [18]:
# table2 -> tidy
# We first need to reset the index
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [19]:
# Then we are able to us pd.melt() to align all values
tidy = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [20]:
# I rename the columns
tidy = tidy.rename(columns={
    'index':'trt',
    'variable':'name',
    'value':'result'
})
# And then reorder the DataFrame
tidy = tidy[['name', 'trt', 'result']]
tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1    John Smith  treatmentb     2.0
2      Jane Doe  treatmenta    16.0
3      Jane Doe  treatmentb    11.0
4  Mary Johnson  treatmenta     3.0
5  Mary Johnson  treatmentb     1.0

In [21]:
# Quick rename of values with the str.replace() method
tidy.trt = tidy.trt.str.replace('treatment', '')
tidy

           name trt  result
0    John Smith   a     NaN
1    John Smith   b     2.0
2      Jane Doe   a    16.0
3      Jane Doe   b    11.0
4  Mary Johnson   a     3.0
5  Mary Johnson   b     1.0

In [22]:
# tidy -> table2
# Using the pd.pivot_table() method, we can form new columns and rows based off previous values
table2 = tidy.pivot_table(index='name', columns='trt', values='result')
table2

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [23]:
import seaborn as sns
flights = sns.load_dataset('flights')

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [24]:
# Using the same method as before, we can change the way the table is viewed
flights_pivot = pd.pivot_table(flights, values='passengers', index='year', columns='month')

# Add these 2 lines if you want months to fall in line
# flights_pivot.columns = [month for month in flights_pivot.columns.tolist()]
# flights_pivot.reset_index()
flights_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

# Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [25]:
##### YOUR CODE HERE #####

# Creating a new table sorted by the number of orders for each product
product_count_inorder = product_order_counts.sort_values(by='counts', ascending=False).rename(columns={'counts':'total count'})
product_count_inorder.head()

       product_id            product_name  total count
24851       24852                  Banana       491291
13175       13176  Bag of Organic Bananas       394930
21136       21137    Organic Strawberries       275577
21902       21903    Organic Baby Spinach       251705
47208       47209    Organic Hass Avocado       220877

In [26]:
# I'm now going to need some other column data from a different file
# Again checking to see which datasets i need
# !head order_products__prior.csv - Nope
!head orders.csv # This one looks like it has what I need

# Loading in the file
orders = pd.read_csv('orders.csv')
orders.head()

order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
2539329,1,prior,1,2,08,
2398795,1,prior,2,3,07,15.0
473747,1,prior,3,3,12,21.0
2254736,1,prior,4,4,07,29.0
431534,1,prior,5,4,15,28.0
3367565,1,prior,6,2,07,19.0
550135,1,prior,7,1,09,20.0
3108588,1,prior,8,1,14,14.0
2295261,1,prior,9,1,16,0.0

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [27]:
# I'm creating a minimalized DataFrame sorting values by the order_id
# I'm doing it this way, because in my mind, these are the most recent orders
# I'M PRETTY SURE I'M WRONG THOUGH!!! (oh well. At least I'm doing it correctly in my mind)
orders = orders.sort_values(by='order_id', ascending=False)
# Dropping columns I don't care about/need
orders_order = orders.drop(columns=['order_dow', 'eval_set'])
# Then reseting the index so I have a nice need accending numerical range
# and again dropping some more columns (index is added when using pd.reset_index())
orders_order = orders_order.reset_index().drop(columns=['index', 'days_since_prior_order'])
orders_order

         order_id  user_id  order_number  order_hour_of_day
0         3421083    25247            24                  6
1         3421082   175185            23                 18
2         3421081   117076             1                 11
3         3421080    52726             2                 11
4         3421079   108687             6                 13
...           ...      ...           ...                ...
3421078         5   156122            42                 16
3421079         4   178520            36                  9
3421080         3   205970            16                 17
3421081         2   202279             3                  9
3421082         1   112108             4                 10

[3421083 rows x 4 columns]

In [28]:
# This next DataFrame holds information connecting the order_id to the product_id
items_in_order_id = order_products.drop(columns=['add_to_cart_order', 'reordered'])
items_in_order_id

         order_id  product_id
0               2       33120
1               2       28985
2               2        9327
3               2       45918
4               2       30035
...           ...         ...
1384612   3421063       14233
1384613   3421063       35548
1384614   3421070       35951
1384615   3421070       16953
1384616   3421070        4724

[33819106 rows x 2 columns]

In [29]:
# Then here, I use that information and merge the order_product and product DataFrames
# using the aformentioned 'order_id to product_id' DataFrame
order_product_corellations = pd.merge(orders_order, items_in_order_id, how='outer', on='order_id')
order_product_corellations = pd.merge(order_product_corellations, products, how='left', on='product_id')
order_product_corellations

          order_id  ...                                  product_name
0          3421083  ...                     Freeze Dried Mango Slices
1          3421083  ...               Purple Carrot & blueberry Puffs
2          3421083  ...      Organic Mixed Berry Yogurt & Fruit Snack
3          3421083  ...       Organic Strawberry Yogurt & Fruit Snack
4          3421083  ...  Organic Strawberry & Mango Dried Tiny Fruits
...            ...  ...                                           ...
33894101         1  ...                                Cucumber Kirby
33894102         1  ...          Lightly Smoked Sardines in Olive Oil
33894103         1  ...                        Bag of Organic Bananas
33894104         1  ...                          Organic Hass Avocado
33894105         1  ...                   Organic Whole String Cheese

[33894106 rows x 6 columns]

In [30]:
# I now create a DataFrame that has the most popular products
popular_products = pd.merge(product_order_counts, product_counts, how='inner')
popular_products = popular_products[popular_products['counts'] > 2900]
popular_products

       product_id                      product_name  counts
33             34              Peanut Butter Cereal    6779
44             45                 European Cucumber   19038
78             79  Wild Albacore Tuna No Salt Added    3755
115           116                   English Muffins    4518
116           117                Petit Suisse Fruit    3756
...           ...                               ...     ...
49604       49605        Classic Hummus Family Size    6134
49609       49610   100% Lactose Free Fat Free Milk    7556
49620       49621                     Challah Bread    4802
49627       49628                 Yoghurt Blueberry    5085
49682       49683                    Cucumber Kirby   99728

[2051 rows x 3 columns]

In [31]:
# Create an empty set for the top 25 latest ordered products
top_25_latest = set()
pos = -1
# While the list has less than 25 popular products:
while len(top_25_latest) < 25:
  pos += 1
  # I check whether the current order_id (decending) is one of the popular products
  if order_product_corellations['product_id'][pos] in popular_products['product_id']:
    # If it is, I add it the the top 25 list
    top_25_latest.add(order_product_corellations['product_name'][pos])
# And here's that list! (In my mind it is)
top_25_latest

{'5 Antioxidant Infusions Sumatra Dragonfruit Drink',
 'Bean & Cheese Burrito',
 'Brioche Hamburger Buns',
 'Butterhead Lettuce',
 'Buttermilk, Cultured Low Fat',
 'Carrots',
 'Chocolate Chip Bunny Grahams Whole Grain Graham Snacks Bunny Grahams',
 'Crackers, Crispy, Cheddar',
 'Cran Raspberry Sparkling Water',
 'Dark Chocolate Nuts & Sea Salt Bars',
 'English Muffins',
 'Geranium Liquid Dish Soap',
 'Gluten Free Steel Cut Oats',
 'Low Sodium Organic Medium Chili',
 'Margherita Pizza',
 'Organic Half & Half',
 'Original Pure Creamy Almond Milk',
 'Peach,  Apricot & Banana Stage 2 Baby Food',
 'Rocky Road Ice Cream',
 'Salt',
 'Salt & Vinegar Potato Crisps',
 'Small Hass Avocado',
 'Unsweetened Almond Milk',
 'Unsweetened Original Almond Breeze Almond Milk',
 'White Paper Towels'}

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [32]:
##### YOUR CODE HERE #####